; domain
(define (domain zeno-travel)
  (:requirements :typing :negative-preconditions)
  (:types aircraft person city flevel - object)

  (:predicates
    (at ?x - (either person aircraft) ?c - city)
    (in ?p - person ?a - aircraft)
    (fuel-level ?a - aircraft ?l - flevel)
    (next ?l1 - flevel ?l2 - flevel)
  )

  (:action board
    :parameters (?p - person ?a - aircraft ?c - city)
    :precondition (and (at ?p ?c) (at ?a ?c))
    :effect (and (not (at ?p ?c)) (in ?p ?a))
  )

  (:action debark
    :parameters (?p - person ?a - aircraft ?c - city)
    :precondition (and (in ?p ?a) (at ?a ?c))
    :effect (and (not (in ?p ?a)) (at ?p ?c))
  )

  (:action fly
    :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 - flevel)
    :precondition (and (at ?a ?c1) (fuel-level ?a ?l1) (next ?l2 ?l1))
    :effect (and (not (at ?a ?c1)) (at ?a ?c2) (not (fuel-level ?a ?l1)) (fuel-level ?a ?l2))
  )

  (:action zoom
    :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 ?l3 - flevel)
    :precondition (and (at ?a ?c1) (fuel-level ?a ?l1) (next ?l2 ?l1) (next ?l3 ?l2))
    :effect (and (not (at ?a ?c1)) (at ?a ?c2) (not (fuel-level ?a ?l1)) (fuel-level ?a ?l3))
  )

  (:action refuel
    :parameters (?a - aircraft ?c - city ?l - flevel ?l1 - flevel)
    :precondition (and (fuel-level ?a ?l) (next ?l ?l1) (at ?a ?c))
    :effect (and (fuel-level ?a ?l1) (not (fuel-level ?a ?l)))
  )
)

; problem
(define (problem ZTRAVEL-3-14)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city5)
	(fuel-level plane1 fl6)
	(at plane2 city2)
	(fuel-level plane2 fl5)
	(at plane3 city8)
	(fuel-level plane3 fl5)
	(at person1 city0)
	(at person2 city8)
	(at person3 city0)
	(at person4 city2)
	(at person5 city8)
	(at person6 city0)
	(at person7 city1)
	(at person8 city8)
	(at person9 city9)
	(at person10 city8)
	(at person11 city7)
	(at person12 city3)
	(at person13 city2)
	(at person14 city7)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane2 city7)
	(at plane3 city6)
	(at person1 city4)
	(at person2 city3)
	(at person3 city9)
	(at person4 city6)
	(at person5 city7)
	(at person6 city9)
	(at person7 city6)
	(at person9 city8)
	(at person10 city7)
	(at person11 city7)
	(at person12 city4)
	(at person14 city7)
	))

)

; plan
1. (board person5 plane3 city8)
   deleted: (at person5 city8)
   added: (in person5 plane3)
   goals met: 2 of 14
2. (zoom plane3 city8 city0 fl5 fl4 fl3)
   deleted: (at plane3 city8) (fuel-level plane3 fl5)
   added: (at plane3 city0) (fuel-level plane3 fl3)
   goals met: 2 of 14
3. (board person6 plane3 city0)
   deleted: (at person6 city0)
   added: (in person6 plane3)
   goals met: 2 of 14
4. (board person3 plane3 city0)
   deleted: (at person3 city0)
   added: (in person3 plane3)
   goals met: 2 of 14
5. (zoom plane3 city0 city8 fl3 fl2 fl1)
   deleted: (at plane3 city0) (fuel-level plane3 fl3)
   added: (at plane3 city8) (fuel-level plane3 fl1)
   goals met: 2 of 14
6. (board person2 plane3 city8)
   deleted: (at person2 city8)
   added: (in person2 plane3)
   goals met: 2 of 14
7. (board person10 plane3 city8)
   deleted: (at person10 city8)
   added: (in person10 plane3)
   goals met: 2 of 14
8. (board person4 plane2 city2)
   deleted: (at person4 city2)
   added: (in person4 plane2)
   goals met: 2 of 14
9. (zoom plane2 city2 city6 fl5 fl4 fl3)
   deleted: (at plane2 city2) (fuel-level plane2 fl5)
   added: (at plane2 city6) (fuel-level plane2 fl3)
   goals met: 2 of 14
10. (debark person4 plane2 city6)
   deleted: (in person4 plane2)
   added: (at person4 city6)
   goals met: 3 of 14
11. (zoom plane2 city6 city7 fl3 fl2 fl1)
   deleted: (at plane2 city6) (fuel-level plane2 fl3)
   added: (at plane2 city7) (fuel-level plane2 fl1)
   goals met: 4 of 14
12. (fly plane3 city8 city7 fl1 fl0)
   deleted: (at plane3 city8) (fuel-level plane3 fl1)
   added: (at plane3 city7) (fuel-level plane3 fl0)
   goals met: 4 of 14
13. (refuel plane3 city7 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 4 of 14
14. (debark person5 plane3 city7)
   deleted: (in person5 plane3)
   added: (at person5 city7)
   goals met: 5 of 14
15. (debark person10 plane3 city7)
   deleted: (in person10 plane3)
   added: (at person10 city7)
   goals met: 6 of 14
16. (fly plane3 city7 city9 fl1 fl0)
   deleted: (at plane3 city7) (fuel-level plane3 fl1)
   added: (at plane3 city9) (fuel-level plane3 fl0)
   goals met: 6 of 14
17. (refuel plane3 city9 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 6 of 14
18. (board person9 plane3 city9)
   deleted: (at person9 city9)
   added: (in person9 plane3)
   goals met: 6 of 14
19. (debark person6 plane3 city9)
   deleted: (in person6 plane3)
   added: (at person6 city9)
   goals met: 7 of 14
20. (debark person3 plane3 city9)
   deleted: (in person3 plane3)
   added: (at person3 city9)
   goals met: 8 of 14
21. (fly plane3 city9 city3 fl1 fl0)
   deleted: (at plane3 city9) (fuel-level plane3 fl1)
   added: (at plane3 city3) (fuel-level plane3 fl0)
   goals met: 8 of 14
22. (refuel plane3 city3 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 8 of 14
23. (debark person2 plane3 city3)
   deleted: (in person2 plane3)
   added: (at person2 city3)
   goals met: 9 of 14
24. (board person12 plane3 city3)
   deleted: (at person12 city3)
   added: (in person12 plane3)
   goals met: 9 of 14
25. (fly plane3 city3 city4 fl1 fl0)
   deleted: (at plane3 city3) (fuel-level plane3 fl1)
   added: (at plane3 city4) (fuel-level plane3 fl0)
   goals met: 9 of 14
26. (refuel plane3 city4 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 9 of 14
27. (debark person12 plane3 city4)
   deleted: (in person12 plane3)
   added: (at person12 city4)
   goals met: 10 of 14
28. (fly plane3 city4 city6 fl1 fl0)
   deleted: (at plane3 city4) (fuel-level plane3 fl1)
   added: (at plane3 city6) (fuel-level plane3 fl0)
   goals met: 11 of 14
29. (refuel plane3 city6 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 11 of 14
30. (zoom plane1 city5 city0 fl6 fl5 fl4)
   deleted: (at plane1 city5) (fuel-level plane1 fl6)
   added: (at plane1 city0) (fuel-level plane1 fl4)
   goals met: 11 of 14
31. (board person1 plane1 city0)
   deleted: (at person1 city0)
   added: (in person1 plane1)
   goals met: 11 of 14
32. (zoom plane1 city0 city4 fl4 fl3 fl2)
   deleted: (at plane1 city0) (fuel-level plane1 fl4)
   added: (at plane1 city4) (fuel-level plane1 fl2)
   goals met: 11 of 14
33. (debark person1 plane1 city4)
   deleted: (in person1 plane1)
   added: (at person1 city4)
   goals met: 12 of 14
34. (zoom plane1 city4 city1 fl2 fl1 fl0)
   deleted: (at plane1 city4) (fuel-level plane1 fl2)
   added: (at plane1 city1) (fuel-level plane1 fl0)
   goals met: 12 of 14
35. (board person7 plane1 city1)
   deleted: (at person7 city1)
   added: (in person7 plane1)
   goals met: 12 of 14
36. (refuel plane1 city1 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 12 of 14
37. (fly plane1 city1 city6 fl1 fl0)
   deleted: (at plane1 city1) (fuel-level plane1 fl1)
   added: (at plane1 city6) (fuel-level plane1 fl0)
   goals met: 12 of 14
38. (debark person7 plane1 city6)
   deleted: (in person7 plane1)
   added: (at person7 city6)
   goals met: 13 of 14
39. (fly plane3 city6 city8 fl1 fl0)
   deleted: (at plane3 city6) (fuel-level plane3 fl1)
   added: (at plane3 city8) (fuel-level plane3 fl0)
   goals met: 12 of 14
40. (refuel plane3 city8 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 12 of 14
41. (debark person9 plane3 city8)
   deleted: (in person9 plane3)
   added: (at person9 city8)
   goals met: 13 of 14
42. (fly plane3 city8 city6 fl1 fl0)
   deleted: (at plane3 city8) (fuel-level plane3 fl1)
   added: (at plane3 city6) (fuel-level plane3 fl0)
   goals met: 14 of 14
